; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v1 - type_3 ?v7 - type_1)
 	      (pred_1 ?v8 - object ?v7 - type_1)
	      (pred_4 ?v1 - type_3 ?v6 - type_2)
	      (pred_2 ?v1 - type_3 ?v8 - object ?v6 - type_2))

   (:action op_2
       :parameters  (?v1 - type_3 ?v5 ?v4 - type_1)
       :precondition (and  (pred_3 ?v1 ?v5))
       :effect (and  (pred_3 ?v1 ?v4)
		     (not (pred_3 ?v1 ?v5))))

   (:action op_3
       :parameters (?v1 - type_3 ?v3 - object ?v2 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_1 ?v3 ?v2) (pred_3 ?v1 ?v2) (pred_4 ?v1 ?v6))
       :effect (and (pred_2 ?v1 ?v3 ?v6)
		    (not (pred_1 ?v3 ?v2)) 
		    (not (pred_4 ?v1 ?v6))))

   (:action op_1
       :parameters (?v1 - type_3 ?v3 - object ?v2 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_2 ?v1 ?v3 ?v6) (pred_3 ?v1 ?v2))
       :effect (and (pred_1 ?v3 ?v2)
		    (pred_4 ?v1 ?v6)
		    (not (pred_2 ?v1 ?v3 ?v6)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_03 obj_09 - type_3
obj_02 obj_07 obj_12 obj_01 - type_2
obj_13 obj_06 obj_11 obj_05 - type_1
obj_08 obj_04 obj_14 obj_10 - object)
(:init
(pred_3 obj_03 obj_11)
(pred_4 obj_03 obj_02)
(pred_4 obj_03 obj_07)
(pred_3 obj_09 obj_06)
(pred_4 obj_09 obj_12)
(pred_4 obj_09 obj_01)
(pred_1 obj_08 obj_11)
(pred_1 obj_04 obj_06)
(pred_1 obj_14 obj_13)
(pred_1 obj_10 obj_06)
)
(:goal
(and
(pred_1 obj_08 obj_05)
(pred_1 obj_04 obj_13)
(pred_1 obj_14 obj_05)
(pred_1 obj_10 obj_06)
)
)

(:constraints
  (always (not (pred_3 obj_03 obj_05)))
)
)

; plan
1. (op_3 obj_03 obj_08 obj_11 obj_07)
   deleted: (pred_1 obj_08 obj_11) (pred_4 obj_03 obj_07)
   added: (pred_2 obj_03 obj_08 obj_07)
   goals met: 1 of 4
2. (op_3 obj_09 obj_04 obj_06 obj_01)
   deleted: (pred_1 obj_04 obj_06) (pred_4 obj_09 obj_01)
   added: (pred_2 obj_09 obj_04 obj_01)
   goals met: 1 of 4
3. (op_2 obj_09 obj_06 obj_13)
   deleted: (pred_3 obj_09 obj_06)
   added: (pred_3 obj_09 obj_13)
   goals met: 1 of 4
4. (op_2 obj_03 obj_11 obj_13)
   deleted: (pred_3 obj_03 obj_11)
   added: (pred_3 obj_03 obj_13)
   goals met: 1 of 4
5. (op_1 obj_09 obj_04 obj_13 obj_01)
   deleted: (pred_2 obj_09 obj_04 obj_01)
   added: (pred_1 obj_04 obj_13) (pred_4 obj_09 obj_01)
   goals met: 2 of 4
6. (op_1 obj_03 obj_08 obj_13 obj_07)
   deleted: (pred_2 obj_03 obj_08 obj_07)
   added: (pred_1 obj_08 obj_13) (pred_4 obj_03 obj_07)
   goals met: 2 of 4
7. (op_3 obj_09 obj_14 obj_13 obj_01)
   deleted: (pred_1 obj_14 obj_13) (pred_4 obj_09 obj_01)
   added: (pred_2 obj_09 obj_14 obj_01)
   goals met: 2 of 4
8. (op_2 obj_09 obj_13 obj_05)
   deleted: (pred_3 obj_09 obj_13)
   added: (pred_3 obj_09 obj_05)
   goals met: 2 of 4
9. (op_1 obj_09 obj_14 obj_05 obj_01)
   deleted: (pred_2 obj_09 obj_14 obj_01)
   added: (pred_1 obj_14 obj_05) (pred_4 obj_09 obj_01)
   goals met: 3 of 4
10. (op_2 obj_09 obj_05 obj_13)
   deleted: (pred_3 obj_09 obj_05)
   added: (pred_3 obj_09 obj_13)
   goals met: 3 of 4
11. (op_3 obj_09 obj_08 obj_13 obj_01)
   deleted: (pred_1 obj_08 obj_13) (pred_4 obj_09 obj_01)
   added: (pred_2 obj_09 obj_08 obj_01)
   goals met: 3 of 4
12. (op_2 obj_09 obj_13 obj_05)
   deleted: (pred_3 obj_09 obj_13)
   added: (pred_3 obj_09 obj_05)
   goals met: 3 of 4
13. (op_1 obj_09 obj_08 obj_05 obj_01)
   deleted: (pred_2 obj_09 obj_08 obj_01)
   added: (pred_1 obj_08 obj_05) (pred_4 obj_09 obj_01)
   goals met: 4 of 4
